Repository: yakushabb/sitra
Catalog: po/*.po
Languages: ar

source: sitra
ar: سطرا

source: Get fonts from online sources
ar: احصل على الخطوط من المصادر عبر الإنترنت

source: Fonts;Install;
ar: Fonts;Install;خطوط;تثبيت;

source: Sitra
ar: سطرا

source: Get your fonts from online sources with a sleek, friendly user interface. Sitra provides a seamless experience for installing, uninstalling and previewing fonts.
ar: احصل على خطوطك من المصادر عبر الإنترنت بواجهة مستخدم أنيقة وسهلة. يوفر سطرا تجربة سلسة لتثبيت الخطوط وإزالتها ومعاينتها.

source: List fonts available on Google Fonts
ar: عرض الخطوط المتاحة على خطوط جوجل

source: Preview the fonts using Fontsource CDN for privacy
ar: معاينة الخطوط باستخدام Fontsource CDN لضمان الخصوصية

source: Get code to use the font in your project, via CDN or npm from fontsource
ar: احصل على كود لاستخدام الخط في مشروعك، عبر CDN أو npm من fontsource

source: Download the fonts on your device in ttf format from google
ar: تنزيل الخطوط على جهازك بتنسيق ttf من جوجل

source: Filter font by category using the toggle buttons or by family and subset using search
ar: تصفية الخطوط حسب الفئة باستخدام أزرار التبديل أو حسب العائلة والمجموعة باستخدام البحث

source: Ronnie Nissan
ar: روني نيسان

source: Showcasing font preview
ar: استعراض معاينة الخط

source: Showcasing font preview when a font is already installed
ar: استعراض معاينة الخط عندما يكون الخط مثبتاً بالفعل

source: Showcasing font preview with different subsets, Arabic in this case
ar: استعراض معاينة الخط بمجموعات أحرف مختلفة، العربية في هذه الحالة

source: Showcasing Use in an Project dialog, showing npm instructions
ar: استعراض حوار "الاستخدام في مشروع"، مع إظهار تعليمات npm

source: Showcasing Use in an Project dialog, showing cdn instructions
ar: استعراض حوار "الاستخدام في مشروع"، مع إظهار تعليمات CDN

source: Sitra helps you install fonts from online sources on your system
ar: يساعدك سطرا على تثبيت الخطوط من المصادر عبر الإنترنت على نظامك

source: translator-credits
ar: روني نيسان https://github.com/ronniedroid/

source: Concessio
ar: كونسيسيو

source: Understand file permissions
ar: فهم أذونات الملفات

source: Embellish
ar: أيمبيليش

source: Install Nerd Fonts
ar: تثبيت خطوط نيرد (Nerd Fonts)

source: Fonts without decorative strokes; clean and modern, commonly used for UI and body text.
ar: خطوط بدون زوائد زخرفية؛ نظيفة وعصرية، تستخدم عادة لواجهات المستخدم والنصوص الأساسية.

source: Decorative fonts designed for headlines and large sizes, not suitable for long text.
ar: خطوط زخرفية مصممة للعناوين والأحجام الكبيرة، وغير مناسبة للنصوص الطويلة.

source: Fonts with decorative strokes at the ends of letters; traditional and often used in print.
ar: خطوط ذات زوائد زخرفية في نهايات الحروف؛ تقليدية وغالباً ما تستخدم في المطبوعات.

source: Fonts that mimic handwritten or cursive styles; informal and expressive.
ar: خطوط تحاكي أسلوب الكتابة اليدوية؛ غير رسمية وتعبيرية.

source: Fonts where all characters have equal width; commonly used for code and terminals.
ar: خطوط حيث يكون لجميع الأحرف عرض متساوٍ؛ تستخدم عادة للبرمجة وواجهات الأوامر.

source: Symbol-based fonts containing pictograms or UI icons instead of letters.
ar: خطوط تعتمد على الرموز وتحتوي على أيقونات بدلاً من الحروف.

source: Fonts that do not fit standard categories or are highly experimental or mixed-style.
ar: خطوط لا تندرج تحت فئات قياسية أو هي خطوط تجريبية أو ذات أنماط مختلطة.

source: Permissive licence allowing almost unrestricted use, modification, and distribution.
ar: ترخيص مرن يسمح بالاستخدام والتعديل والتوزيع دون قيود تقريباً.

source: Free to use, modify, and distribute, with conditions: no selling and original licence must be included.
ar: حر في الاستخدام والتعديل والتوزيع، بشرط: عدم البيع وإدراج الترخيص الأصلي.

source: Permissive, requires attribution, notice of changes, and inclusion of NOTICE file. Modified code can use a different licence.
ar: مرن، يتطلب الإسناد، والتنبيه بالتغييرات، وإدراج ملف NOTICE. يمكن للكود المعدل استخدام ترخيص مختلف.

source: Permissive, requires attribution and licence file.
ar: مرن، يتطلب الإسناد وملف الترخيص.

source: Permissive license allowing unrestricted use, modification, and distribution.
ar: ترخيص مرن يسمح بالاستخدام والتعديل والتوزيع دون قيود.

source: arabic
ar: العربية

source: armenian
ar: الأرمنية

source: bengali
ar: البنغالية

source: canadian-aboriginal
ar: السكان الأصليين لكندا

source: cherokee
ar: شيروكي

source: cyrillic
ar: السيريلية

source: cyrillic-ext
ar: السيريلية الممتدة

source: devanagari
ar: ديواناجاري

source: ethiopic
ar: الإثيوبية

source: georgian
ar: الجورجية

source: greek
ar: اليونانية

source: greek-ext
ar: اليونانية الممتدة

source: gujarati
ar: غوجاراتية

source: gurmukhi
ar: غورموخي

source: hebrew
ar: العبرية

source: japanese
ar: اليابانية

source: kannada
ar: كانادا

source: khmer
ar: الخميرية

source: korean
ar: الكورية

source: latin
ar: اللاتينية

source: latin-ext
ar: اللاتينية الممتدة

source: malayalam
ar: المالايالامية

source: myanmar
ar: ميانمار

source: oriya
ar: أوريا

source: sinhala
ar: السنهالية

source: syriac
ar: السريانية

source: tamil
ar: التاميلية

source: telugu
ar: تيلوغو

source: thai
ar: التايلاندية

source: tibetan
ar: التبتية

source: vietnamese
ar: الفيتنامية

source: Integration
ar: إدماج

source: Install
ar: تثبيت

source: Install the font using npm or yarn
ar: تثبيت الخط باستخدام npm أو yarn

source: Use Static Version
ar: استخدام النسخة الثابتة

source: Install the static version instead of variable font
ar: تثبيت النسخة الثابتة بدلاً من الخط المتغير

source: Copy to clipboard
ar: نسخ إلى الحافظة

source: Import
ar: استيراد

source: Import into CSS
ar: استيراد إلى ملف CSS

source: Use in CSS
ar: استخدام في CSS

source: Chose from the options below
ar: اختر من الخيارات أدناه

source: Use the static version instead of variable font
ar: استخدام النسخة الثابتة بدلاً من الخط المتغير

source: Subset
ar: المجموعة الفرعية

source: Weight
ar: الوزن

source: Style
ar: النمط

source: Display
ar: عرض

source: Format
ar: التنسيق

source: Copy below code to your global CSS
ar: انسخ الكود أدناه إلى ملف CSS العالمي الخاص بك

source: Copied to clipboard
ar: تم النسخ إلى الحافظة

source: No description available
ar: لا يوجد وصف متاح

source: Sans Serif
ar: بدون زوائد

source: Serif
ar: بزوائد

source: Handwriting
ar: خط يد

source: Monospace
ar: أحادي المسافة

source: Icons
ar: أيقونات

source: Font '%s' is already installed
ar: الخط '%s' مثبت بالفعل

source: Installation cancelled
ar: تم إلغاء التثبيت

source: Font '%s' is not installed
ar: الخط '%s' غير مثبت

source: Failed to save installed fonts database after uninstallation: %s
ar: فشل حفظ قاعدة بيانات الخطوط المثبتة بعد إلغاء التثبيت: %s

source: Failed to download font file: HTTP %u
ar: فشل تنزيل ملف الخط: HTTP %u

source: Failed to download font file: %s
ar: فشل تنزيل ملف الخط: %s

source: Failed to save installed fonts database: %s
ar: فشل حفظ قاعدة بيانات الخطوط المثبتة: %s

# shortcut window
source: General
ar: عام

# shortcut window
source: Show Shortcuts
ar: إظهار الاختصارات

# shortcut window
source: Quit
ar: إنهاء

source: Main menu
ar: القائمة الرئيسية

source: Search fonts
ar: البحث عن الخطوط

source: Preview
ar: معاينة

source: Welcome to Sitra
ar: مرحباً بك في سطرا

source: Please select a font to preview it here
ar: يرجى اختيار خط لمعاينته هنا

source: Reload
ar: إعادة التحميل

source: You are not connected to the internet, font preview won't work
ar: أنت غير متصل بالإنترنت، لن تعمل معاينة الخطوط

source: Font Size
ar: حجم الخط

source: Line Height
ar: ارتفاع السطر

source: Letter Spacing
ar: تباعد الأحرف

source: Italic
ar: مائل

source: Font Name
ar: اسم الخط

source: Category
ar: الفئة

source: License
ar: الترخيص

source: Cancel
ar: إلغاء

source: Uninstall
ar: إلغاء التثبيت

source: Use in a Project
ar: استخدام في مشروع

source: No Internet connection
ar: لا يوجد اتصال بالإنترنت

source: You are not connected to the internet, font previews can't work offline.
ar: أنت غير متصل بالإنترنت، لا يمكن لمعاينة الخطوط العمل دون اتصال.

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح

source: About App
ar: حول التطبيق

source: Variable
ar: متغير

source: Font '%s' installed successfully
ar: تم تثبيت الخط '%s' بنجاح

source: Failed to install '%s': %s
ar: فشل تثبيت '%s': %s

source: Font '%s' uninstalled successfully
ar: تم إلغاء تثبيت الخط '%s' بنجاح

source: Failed to uninstall '%s': %s
ar: فشل إلغاء تثبيت '%s': %s

source: No preview available
ar: لا توجد معاينة متاحة

source: Extended
ar: ممتد
